Revit 2026 API

# StructuralAsset Methods

---

The StructuralAsset type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Copy | Produces a copy of the asset. |
|  | Dispose |  |
|  | Equals(Object) | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | Equals(StructuralAsset) | Determines whether this structural asset is equal to another. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetPoissonRatio | Sets the Poisson ratio of the asset. |
|  | SetShearModulus | Sets the shear modulus of the asset. |
|  | SetThermalExpansionCoefficient | Sets the thermal expansion coefficient of the asset. |
|  | SetYoungModulus | Sets the Young's modulus of the asset. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace